tap "dart-lang/dart"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "neovim/neovim"
# Search tool like grep, but optimized for programmers
brew "ack"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Programmable completion for Bash 4.1+
brew "bash-completion@2"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Fish completion for brew-cask
brew "brew-cask-completion"
# Formatting tools for C, C++, Obj-C, Java, JavaScript, TypeScript
brew "clang-format"
# Control the macOS dark mode from the command-line
brew "dark-mode"
# Bash, Zsh and Fish completion for Docker
brew "docker-completion"
# Docker-compose completion script
brew "docker-compose-completion"
# Docker-machine completion script
brew "docker-machine-completion"
# Banner-like program prints strings as ASCII art
brew "figlet"
# Infamous electronic fortune-cookie generator
brew "fortune"
# Command-line utility for uploading Gists
brew "gist"
# Distributed revision control system
brew "git"
# Simple and efficient way to access statistics in git
brew "git-quick-stats"
# Prevents you from committing sensitive information to a git repo
brew "git-secrets"
# Perl compatible regular expressions library
brew "pcre"
# Interpreted, interactive, object-oriented programming language
brew "python"
# Core application library for C
brew "glib"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Convert source code to formatted text with syntax highlighting
brew "highlight"
# Improved top (interactive process viewer)
brew "htop"
# Generic library support script
brew "libtool"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# JSON output from a shell
brew "jo"
# Regular expressions library
brew "oniguruma"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Rainbows and unicorns in your console!
brew "lolcat"
# Generate mobile app icons in all resolutions for both iOS and Android
brew "makeicon"
# Mac App Store command-line interface
brew "mas"
# Node version management
brew "n"
# Fast, highly customisable system info script
brew "neofetch"
# Utility for managing network connections
brew "netcat"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Shell command parallelization utility
brew "parallel"
# Monitor data's progress through a pipe
brew "pv"
# Tools for and transforming and inspecting PDF files
brew "qpdf"
# Perl-powered file rename script with many helpful built-ins
brew "rename"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# SOund eXchange: universal sound sample translator
brew "sox"
# Add a public key to a remote machine's authorized_keys file
brew "ssh-copy-id"
# Granddaddy of HTML tools, with support for modern standards
brew "tidy-html5"
# Terminal multiplexer
brew "tmux"
# Command-line translator using Google Translate and more
brew "translate-shell"
# CLI tool that moves files or folder to the trash
brew "trash"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Extraction utility for .zip compressed archives
brew "unzip"
# Pager/text based browser
brew "w3m"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Watch files and take action when they change
brew "watchman"
# Internet file retriever
brew "wget"
# Bash completion for Wpcli
brew "wp-cli-completion"
# Bash completion for Yarn
brew "yarn-completion"
# The Dart SDK
brew "dart-lang/dart/dart"
cask "amazon-music"
cask "betterzipql"
cask "dropbox"
cask "firefox"
cask "font-ibm-plex"
cask "google-chrome"
cask "graphql-playground"
cask "handbrakecli"
cask "imageoptim"
cask "keeweb"
cask "provisionql"
cask "pusher"
cask "qlcolorcode"
cask "qlimagesize"
cask "qlmarkdown"
cask "qlprettypatch"
cask "qlstephen"
cask "quicklook-csv"
cask "quicklook-json"
cask "quicklookapk"
cask "react-native-debugger"
cask "soundflower"
cask "vlc"
cask "xquartz"
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Microsoft Remote Desktop", id: 715768417
mas "Sip", id: 507257563
mas "Xcode", id: 497799835
